huskyroboticsteam/Swerve_Motor_Board_PY2023/SwerveMotorFirmware.cydsn/Generated_Source/PSoC4/project.h
/*******************************************************************************
* File Name: project.h
* 
* PSoC Creator  4.4
*
* Description:
* It contains references to all generated header files and should not be modified.
* This file is automatically generated by PSoC Creator.
*
********************************************************************************
* Copyright (c) 2007-2020 Cypress Semiconductor.  All rights reserved.
* You may use this file only in accordance with the license, terms, conditions, 
* disclaimers, and limitations in the end user license agreement accompanying 
* the software package with which this file was provided.
********************************************************************************/

#include "cyfitter_cfg.h"
#include "cydevice_trm.h"
#include "cyfitter.h"
#include "cydisabledsheets.h"
#include "Limit1.h"
#include "Limit1_aliases.h"
#include "Limit2.h"
#include "Limit2_aliases.h"
#include "PWM_Motor1.h"
#include "isr_Limit_1.h"
#include "Motor1PWM.h"
#include "Motor1PWM_aliases.h"
#include "Clock_PWM1.h"
#include "Pin_Pot.h"
#include "Pin_Pot_aliases.h"
#include "Pin_Encoder_A.h"
#include "Pin_Encoder_A_aliases.h"
#include "Pin_Encoder_B.h"
#include "Pin_Encoder_B_aliases.h"
#include "Status_Reg_Switches.h"
#include "Clock_2.h"
#include "CANRX.h"
#include "CANRX_aliases.h"
#include "CANTX.h"
#include "CANTX_aliases.h"
#include "CAN.h"
#include "UART.h"
#include "UART_SPI_UART.h"
#include "UART_PINS.h"
#include "UART_SPI_UART_PVT.h"
#include "UART_PVT.h"
#include "UART_BOOT.h"
#include "Can_addr.h"
#include "Dip1.h"
#include "Dip1_aliases.h"
#include "Dip2.h"
#include "Dip2_aliases.h"
#include "Dip3.h"
#include "Dip3_aliases.h"
#include "Dip4.h"
#include "Dip4_aliases.h"
#include "timer_clock.h"
#include "Timer_1.h"
#include "isr_period.h"
#include "LED_Debug1.h"
#include "LED_Debug1_aliases.h"
#include "LED_Debug2.h"
#include "LED_Debug2_aliases.h"
#include "LED_CAN.h"
#include "LED_CAN_aliases.h"
#include "LED_Error.h"
#include "LED_Error_aliases.h"
#include "StripLights.h"
#include "StripLights_fonts.h"
#include "Array_LED.h"
#include "Array_LED_aliases.h"
#include "Motor1Fault.h"
#include "Motor1Fault_aliases.h"
#include "Motor2Fault.h"
#include "Motor2Fault_aliases.h"
#include "PWM_Motor2.h"
#include "Motor1Direction.h"
#include "Motor1Direction_aliases.h"
#include "Motor2PWM.h"
#include "Motor2PWM_aliases.h"
#include "Clock_PWM2.h"
#include "Motor2Direction.h"
#include "Motor2Direction_aliases.h"
#include "Motor1CurrentSense.h"
#include "Motor1CurrentSense_aliases.h"
#include "Motor2CurrentSense.h"
#include "Motor2CurrentSense_aliases.h"
#include "isr_encB.h"
#include "isr_encA.h"
#include "ADC_Pot.h"
#include "CAN_isr.h"
#include "CAN_HFCLK.h"
#include "UART_SCBCLK.h"
#include "UART_tx.h"
#include "UART_tx_aliases.h"
#include "UART_SCB_IRQ.h"
#include "UART_rx.h"
#include "UART_rx_aliases.h"
#include "StripLights_StringSel.h"
#include "StripLights_cisr.h"
#include "StripLights_fisr.h"
#include "ADC_Pot_IRQ.h"
#include "ADC_Pot_intClock.h"
#include "core_cm0_psoc4.h"
#include "CyFlash.h"
#include "CyLib.h"
#include "cyPm.h"
#include "cytypes.h"
#include "cypins.h"
#include "CyDMA.h"
#include "CyLFClk.h"
#include "cy_em_eeprom.h"

/*[]*/

